In [3]:
import pandas as pd
import numpy as np

In [18]:
d = pd.Series([1,3,5,np.nan,6,8])
d

x = pd.Series([10, 20, 30, 40, 50], index =['a', 'b', 'c', 'd', 'e'])
print(x)

# numpy array
data = np.array(['a', 'b', 'c', 'd', 'e'])
# creating series
s = pd.Series(data)
print(s)

# create a dictionary
dictionary = {'A' : 10, 'B' : 20, 'C' : 30}
# create a series
dic = pd.Series(dictionary)
print(dic)

a    10
b    20
c    30
d    40
e    50
dtype: int64
0    a
1    b
2    c
3    d
4    e
dtype: object
A    10
B    20
C    30
dtype: int64

In [20]:
# using series.to_frame to
# convert series to dataframe
df = x.to_frame().reset_index()
print(df)

y = x.index
print(y)
df['y'] = y
print(df)

  index   0
0     a  10
1     b  20
2     c  30
3     d  40
4     e  50
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
  index   0  y
0     a  10  a
1     b  20  b
2     c  30  c
3     d  40  d
4     e  50  e

In [23]:
a = pd.Series(["ABC", "DEF","GHI"])
  
b = pd.Series(["JKL", "MNO", "PQR"])
  
# combine two series then create a dataframe
df = pd.DataFrame(a.append(b, ignore_index = True))
print(df)
df1 = pd.DataFrame(a.append(b,ignore_index = False))
print(df1)

     0
0  ABC
1  DEF
2  GHI
3  JKL
4  MNO
5  PQR
     0
0  ABC
1  DEF
2  GHI
0  JKL
1  MNO
2  PQR

In [24]:
# creating 2 Pandas Series
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series([6, 7, 8, 9, 10])
  
series3 = series1 + series2
series4 = series1 - series2
series5 = series1 * series2
series6 = series1 / series2
  
# displaying the result
print(series3)
print(series4)
print(series5)
print(series6)

0     7
1     9
2    11
3    13
4    15
dtype: int64
0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64
0     6
1    14
2    24
3    36
4    50
dtype: int64
0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [25]:
# Creating 2 pandas Series
ps1 = pd.Series([2.5, 4, 6, 8, 10, 1.75, 40])
ps2 = pd.Series([1.5, 3, 5, 7, 10, 1.75, 20])
  
# Compare the series using '==' and '!=' Relational operators
print("\nCompare the elements of the two given Series:")
print("\nEqual:")
print(ps1 == ps2)
print("\nNot Equal:")
print(ps1 != ps2)

Compare the elements of the two given Series:

Equal:
0    False
1    False
2    False
3    False
4     True
5     True
6    False
dtype: bool

Not Equal:
0     True
1     True
2     True
3     True
4    False
5    False
6     True
dtype: bool

In [26]:
data=pd.DataFrame({'Name':pd.Series(["Ana", "Priya", "Charu", "Suchi","Richa"]),
                  'Score':pd.Series([45,65,78,12,4]),
                  'Attemps':pd.Series([5,3,4,4,2]),
                  'Qulaify':pd.Categorical(["no", "yes", "yes", "no", "no"]),
                  })
data

    Name  Score  Attemps Qulaify
0    Ana     45        5      no
1  Priya     65        3     yes
2  Charu     78        4     yes
3  Suchi     12        4      no
4  Richa      4        2      no

In [29]:
data.head(3)

    Name  Score  Attemps Qulaify
0    Ana     45        5      no
1  Priya     65        3     yes
2  Charu     78        4     yes

In [32]:
data.iloc[:3]

    Name  Score  Attemps Qulaify
0    Ana     45        5      no
1  Priya     65        3     yes
2  Charu     78        4     yes

In [39]:
data.loc[:,["Name","Score"]]

    Name  Score
0    Ana     45
1  Priya     65
2  Charu     78
3  Suchi     12
4  Richa      4

In [45]:
row = int(input("Enter the row number "))
col = input("Enter the name of the column")

data.loc[row,[col]]

Name    Priya
Name: 1, dtype: object

In [66]:
print(data[data.Score<20 ])
print("\n")
print(data[data['Score'].between(5, 20)])
print("\n")
data.loc[(data["Score"] > 0) & (data['Score'] <20)]

    Name  Score  Attemps Qulaify
3  Suchi     12        4      no
4  Richa      4        2      no


    Name  Score  Attemps Qulaify
3  Suchi     12        4      no

    Name  Score  Attemps Qulaify
3  Suchi     12        4      no
4  Richa      4        2      no

In [65]:

data.loc[(data["Score"] > 50) & (data['Attemps'] <4)]

    Name  Score  Attemps Qulaify
1  Priya     65        3     yes

In [67]:
sum(data.Attemps)

18